Tekla.Structures.Model.RebarSplice.RebarSpliceTypeEnum
The splice types.

Tekla.Structures.Model.RebarSplice.RebarSpliceTypeEnum.SPLICE_TYPE_LAP_RIGHT
The first (left) bar extends over the second (right) bar.

Tekla.Structures.Model.RebarSplice.RebarSpliceTypeEnum.SPLICE_TYPE_LAP_LEFT
The second (right) bar extends over the first (left) bar.

Tekla.Structures.Model.RebarSplice.RebarSpliceTypeEnum.SPLICE_TYPE_LAP_BOTH
Both bars extend over each other.

Tekla.Structures.Model.RebarSplice.RebarSpliceTypeEnum.SPLICE_TYPE_MUFF
The bar ends are joined with a muff.

Tekla.Structures.Model.RebarSplice.RebarSpliceTypeEnum.SPLICE_TYPE_WELD
The bar ends are joined with a weld.